rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
// ============================================================
//  TROTADORA PARA RATAS — Control PID v9.11.0
//  Plataforma: ESP32 + Driver VNH5019 + Sensor Hall + KY-040
//
//  Cambios v9.10.1 → v9.11.0:
//    - NUEVO: Timer fallback en loop() — PID garantizado mínimo 20 Hz
//      independientemente de la frecuencia de pulsos Hall.
//      Resuelve respuesta lenta ante frenado brusco de la cinta.
//  Cambios v9.10 → v9.10.1:
//    - CORREGIDO: firstControlCall = false en activarPID()
//    - CORREGIDO: pidLastError inicializado con error real
//    - CORREGIDO: Anti-windup con rango simétrico ±(PWM_MAX - PWM_MIN)/Ki
//    - CORREGIDO: Protección Ki > 0 para evitar división por cero
// ============================================================

#include <Arduino.h>
#include <WiFi.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <algorithm>
#include "motor_config.h"
#include <ESP32Encoder.h>
#include <PID_v1.h>

// ============================================================
// 1. RED / SERVIDOR
// ============================================================
const char* ssid       = "ESP32_Motor_Control";
const char* apPassword = "12345678";

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");

bool          isWebConnected  = false;
unsigned long lastWsSendTime  = 0;
const unsigned long WS_SEND_INTERVAL = 200;

// ============================================================
// 2. CONSTANTES PWM / FÍSICAS
// ============================================================
// Debounce dinámico: rechaza períodos menores a HALL_DEBOUNCE_RATIO × mediana
// actual (equivale a un salto de velocidad >2x entre pulsos, físicamente
// imposible en la cinta). HALL_DEBOUNCE_US (5 ms, motor_config.h) es el piso
// en arranque/timeout; el techo mantiene protección proporcional en todo el
// rango operativo 0.2–1.5 m/s (períodos ~13–100 ms).
#define HALL_DEBOUNCE_RATIO    0.5f
#define HALL_DEBOUNCE_MAX_US   60000UL
static volatile uint32_t hallMinPeriodUs = HALL_DEBOUNCE_US;

// Límites de salida del PID
#define PID_OUTPUT_MIN   100          // PWM mínimo para vencer fricción estática
#define PID_OUTPUT_MAX   MAX_VELOCITY // 1023
#define PID_STARTUP_PWM  100          // Semilla del integrador al activar el PID (bumpless transfer)

static_assert(HALL_BUFFER_SIZE > 1, "HALL_BUFFER_SIZE debe ser > 1");

// Basadas en HALL_SLOTS_COUNT (posiciones geométricas), no en MAGNETS_COUNT:
// valen para un período "normal" (1 slot). El período del hueco (diente
// faltante) equivale a 2 slots y se trata aparte en calculateSpeed().
static const float HALL_CONST_RPM   = 60000000.0f / (float)HALL_SLOTS_COUNT;
static const float HALL_CONST_SPEED = (3.14159265f * DRIVE_ROLLER_DIAMETER_MM * 1000.0f)
                                       / (float)HALL_SLOTS_COUNT;

// ============================================================
// 3. TEMPORIZACIÓN
// ============================================================
#define PID_TIMER_INTERVAL_MS   25UL   // cadencia del loop PID (40 Hz mínimo aunque fallen pulsos Hall)
#define LCD_UPDATE_INTERVAL    300UL   // refresco de pantalla LCD
#define DEBUG_INTERVAL        1000UL   // log de depuración por serial
#define CURRENT_READ_INTERVAL 50UL    // lectura del sensor de corriente (20 Hz)

// ============================================================
// 4. FILTRO DE MEDIANA + EMA
// ============================================================
#define FILTER_SIZE   3
#define SMOOTH_ALPHA  1.0f  // EMA desactivada (peso 100% al valor nuevo)

static uint32_t filterBuffer[FILTER_SIZE];
static uint8_t  filterIndex = 0;
static uint8_t  filterCount = 0;

// Último período normal individual (no la mediana) — referencia para detectar
// el hueco del diente faltante. Sigue el ritmo pulso a pulso, así no se
// atrasa durante una aceleración fuerte (la mediana de varios sí se atrasa).
static uint32_t lastNormalPeriodUs = 0;

static float filteredRPM_Last = 0.0f;
static float filteredVel_Last = 0.0f;

// --- Velocidad para display (LCD) ---
// Promedio deslizante de los últimos (MAGNETS_COUNT-1) períodos normales
// (= 1 vuelta completa, sin contar el hueco del diente faltante): cancela
// el error por espaciado desigual de imanes y actualiza en cada pulso
// normal. Solo para mostrar; el PID sigue usando la mediana.
static uint32_t revPeriodBuffer[MAGNETS_COUNT - 1] = {0};
static uint8_t  revBufIndex    = 0;
static uint8_t  revBufCount    = 0;
static uint32_t revPeriodSum   = 0;
static float    displaySpeedMs = 0.0f;

// ============================================================
// 5. VARIABLES DE VELOCIDAD / PID
// ============================================================
float currentRPM           = 0.0f;
float currentLinearSpeedMs = 0.0f;
float setpointSpeed        = 0.0f;   // Setpoint activo (confirmado)
float pendingSetpoint      = 0.0f;   // Setpoint temporal del encoder
float pidOutput            = 0.0f;
bool  setpointPending      = false;  // Hay un setpoint pendiente de confirmar

// --- CSV LOG ---
bool csvLogActive = false;

// --- MONITOR HALL ---
static uint8_t magnetCount     = 0;     // cuenta pulsos normales en la vuelta actual (0..MAGNETS_COUNT-2), la resincroniza el hueco
static bool    hallDebugActive = false; // activado con "HALL ON" por serial

// --- PID Brett Beauregard ---
double Kp = 50.0;
double Ki = 50.0;
double Kd = 0.0;

double pidIn  = 0.0;  // Input  → currentLinearSpeedMs
double pidOut = 0.0;  // Output → PWM
double pidSp  = 0.0;  // Setpoint

PID myPID(&pidIn, &pidOut, &pidSp, Kp, Ki, Kd, DIRECT);

float pidIntegral = 0.0f;          // NO USADO — reservado para compatibilidad WS
unsigned long lastControlMicros = 0; // para el fallback timer de loop()

// Feed-Forward cache (tabla empírica conservada, no activa)
float lastFF_PWM = 0.0f;

// ============================================================
// 6. BUFFER CIRCULAR HALL
// ============================================================
static volatile uint32_t hallPeriodBuffer[HALL_BUFFER_SIZE] = {0};
static volatile uint8_t  hallBufferHead  = 0;
static volatile uint8_t  hallBufferCount = 0;
static volatile uint32_t lastHallMicros  = 0;
static uint8_t           lastProcessedHead = 0;

