rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
  } else if (strcmp(buf, "HALL ON") == 0) {
    hallDebugActive = true;
    magnetCount     = 0;
    Serial.println("[HALL] Monitor activado — imprime cada iman y cada vuelta");

  } else if (strcmp(buf, "HALL OFF") == 0) {
    hallDebugActive = false;
    Serial.println("[HALL] Monitor desactivado");

  } else if (strcmp(buf, "LOG START") == 0) {
    csvLogActive = true;
    Serial.println("t_ms,periodo_us,vel_cruda_m_s,setpoint_m_s,error_rel");

  } else if (strcmp(buf, "LOG STOP") == 0) {
    csvLogActive = false;
    Serial.println("[LOG] Detenido");

  } else if (strcmp(buf, "HELP") == 0) {
    Serial.println("CMD: SET SP <m/s> | GET VEL | GET ENC | RESET ENC | GET CUR | STOP | TUNE <Kp Ki Kd> | PWM <0..MAX> | LOG START | LOG STOP | HALL ON | HALL OFF");

  } else {
    Serial.printf("[ERR] Desconocido: '%s'\n", cmd);
  }
}

// leerSerial: arma línea a línea los bytes entrantes de Serial y despacha cada
// comando completo (terminado en \n o \r) a procesarComandoSerial()
static void leerSerial() {
  while (Serial.available()) {
    char c = Serial.read();
    if (c == '\n' || c == '\r') {
      if (serialIdx > 0) {
        serialBuf[serialIdx] = '\0';
        procesarComandoSerial(serialBuf);
        serialIdx = 0;
      }
    } else if (serialIdx < (sizeof(serialBuf) - 1)) {
      serialBuf[serialIdx++] = c;
    }
  }
}

// ============================================================
// 19. WEBSOCKET
// ============================================================
// broadcastState: arma el JSON de estado (velocidad, setpoint, PID, encoder, corriente,
// log crudo de pulsos) y lo envía por WebSocket a todos los clientes conectados
void broadcastState() {
  if (ws.count() == 0) {
    pulseLogCount    = 0;
    pulseLogOverflow = false;
    return;
  }

  JsonDocument doc;
  doc["velocity"]       = (int)round(pidOutput);
  doc["current"]        = cachedCurrent;
  doc["rpm"]            = currentRPM;
  doc["speed_m_s"]      = currentLinearSpeedMs;
  doc["speed_mm_s"]     = currentLinearSpeedMs * 1000.0f;
  doc["sp_m_s"]         = setpointSpeed;
  doc["sp_pending_m_s"] = setpointPending ? pendingSetpoint : setpointSpeed;
  doc["sp_pending"]     = setpointPending;
  doc["encoder"]        = displayEncoderCount;
  doc["encoder_raw"]    = encoder.getCount();
  doc["pid_integral"]   = pidIntegral;
  doc["ff_pwm"]         = lastFF_PWM;
  doc["kp"]             = Kp;
  doc["ki"]             = Ki;
  doc["kd"]             = Kd;

  // Log crudo imán por imán
  if (pulseLogCount > 0) {
    JsonArray pulses = doc["pulses"].to<JsonArray>();
    for (uint8_t i = 0; i < pulseLogCount; i++) {
      JsonObject p = pulses.add<JsonObject>();
      p["p"] = pulseLogBuffer[i].periodo_us;
      p["v"] = pulseLogBuffer[i].vel_m_s;
      p["r"] = pulseLogBuffer[i].rpm;
    }
    pulseLogCount = 0;
  }
  if (pulseLogOverflow) {
    doc["pulses_overflow"] = true;
    pulseLogOverflow = false;
  }

  String json;
  serializeJson(doc, json);
  ws.textAll(json);
}

// onWebSocketEvent: maneja conexión/desconexión de clientes y los mensajes JSON
// entrantes (led, sp, sp_pending, confirm_sp, stop, tune) desde la interfaz web
void onWebSocketEvent(AsyncWebSocket* srv, AsyncWebSocketClient* client,
                      AwsEventType type, void* arg, uint8_t* data, size_t len) {
  if (type == WS_EVT_CONNECT) {
    if (ws.count() > 2) { client->close(); return; }
    Serial.printf("[WS] Cliente conectado (id=%u, total=%u)\n",
                  client->id(), ws.count());
    isWebConnected = true;
    digitalWrite(LED_BUILTIN_PIN, HIGH);
    broadcastState();

  } else if (type == WS_EVT_DISCONNECT) {
    Serial.printf("[WS] Cliente desconectado (id=%u, total=%u)\n",
                  client->id(), ws.count());
    if (ws.count() == 0) {
      isWebConnected = false;
      digitalWrite(LED_BUILTIN_PIN, LOW);
    }

  } else if (type == WS_EVT_DATA) {
    AwsFrameInfo* info = (AwsFrameInfo*)arg;
    if (!info->final || info->index != 0 || info->len != len
        || info->opcode != WS_TEXT) return;

    JsonDocument doc;
    if (deserializeJson(doc, data, len)) return;

    bool changed = false;

    if (doc["led"].is<bool>()) {
      digitalWrite(LED_BUILTIN_PIN, doc["led"].as<bool>() ? HIGH : LOW);
      changed = true;
    }

    if (doc["sp"].is<float>() || doc["sp"].is<int>()) {
      float sp = constrain(doc["sp"].as<float>(), 0.0f, 2.0f);
      setpointSpeed   = sp;
      pendingSetpoint = sp;
      setpointPending = false;

      if (sp == 0.0f) {
        motorStop();
      } else {
        configurarMotorReversa();
        activarPID(sp);
      }
      changed = true;
    }

    if (doc["sp_pending"].is<float>() || doc["sp_pending"].is<int>()) {
      pendingSetpoint = constrain(doc["sp_pending"].as<float>(), 0.0f, 2.0f);
      setpointPending = true;
      changed = true;
    }

    if (doc["confirm_sp"].is<bool>() && doc["confirm_sp"].as<bool>()) {
      confirmarSetpoint();
      changed = true;
    }

    if (doc["stop"].is<bool>() && doc["stop"].as<bool>()) {
      motorStop();
      changed = true;
    }

    if (doc["tune"].is<JsonObject>()) {
      JsonObject t = doc["tune"].as<JsonObject>();
      Kp = t["kp"] | 50.0;
      Ki = t["ki"] | 5.0;
      Kd = t["kd"] | 0.0;
      myPID.SetTunings(Kp, Ki, Kd);
      Serial.printf("[TUNE WS] Kp=%.2f Ki=%.2f Kd=%.2f\n", Kp, Ki, Kd);
      changed = true;
    }

    if (changed) broadcastState();
  }
}

// ============================================================
// 20. HTTP
// ============================================================
// setupHTTPEndpoints: sirve la SPA (index.html) y el monitor (monitor.html)
// desde LittleFS; sin fallback embebido
void setupHTTPEndpoints() {
  if (LittleFS.begin(true)) {
    server.serveStatic("/", LittleFS, "/").setDefaultFile("index.html");
    Serial.println("[FS] LittleFS OK");
  } else {
    Serial.println("[FS] LittleFS no disponible");
  }
}

// ============================================================
// 21. LCD
// ============================================================
// scanI2CAddress: barre el bus I2C buscando una dirección conocida de LCD (0x27 o 0x3F)
uint8_t scanI2CAddress() {
  for (uint8_t addr = 0x20; addr < 0x40; addr++) {
    Wire.beginTransmission(addr);
    if (Wire.endTransmission() == 0) {
      if (addr == 0x27 || addr == 0x3F) return addr;
    }
  }
  return 0;
}

